/* 009. 두개의 값 비교하기 (비교 연산자) */

/**
 * A == B  ; a,b 의 값이 같은가
 * A === B ; a,b 의 값과 데이터 값이 같은가
 * A != B ; a,b 의 값이 다른가
 * A !== B ; a,b 의 값과 데이터 타입이 다른가
 * A < B ; a가 b 보다 작은가 
 * A <= B ; a가 b보다 작거나 같은가
 * A > B ; a가 b보다 큰가
 * A >= B ; a가 b보다 크거나 같은가  
  */


/*  == 와 === 의 차이점 
    == 를 사용한 비교는 두 비교 대상이 다른 타입이라도 동일한 것으로 간주하여 비교한다
    
    ===를 사용한 비교는 두 데이터의 타입이 다르면 다른 데이터로 간주하여 비교한다.
*/

/* 010. 복합형 (축약형) 대입연산자 사용하기 
계산식을 간략하게 나타내고 싶을때 */

/** 
 *  x = y -> x =y 
 *  x += y -> x = x + y
 *  x -= y -> x = x - y
 *  x *= y -> x = x * y
 *  x /= y -> x = x / y 
 *  x %= y -> x = x % y
 */
